In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
titanic = sns.load_dataset("titanic") 
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
titanic.describe().T

          count       mean        std   min      25%      50%   75%       max
survived  891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000
pclass    891.0   2.308642   0.836071  1.00   2.0000   3.0000   3.0    3.0000
age       714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
sibsp     891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
parch     891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000
fare      891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

In [4]:
print(titanic[titanic['age']<33][['pclass','age']])

     pclass   age
0         3  22.0
2         3  26.0
7         3   2.0
8         3  27.0
9         2  14.0
..      ...   ...
884       3  25.0
886       2  27.0
887       1  19.0
889       1  26.0
890       3  32.0

[448 rows x 2 columns]

In [5]:
titanic['age_0']=0

In [6]:
print(titanic)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone  age_0
0      man        True  NaN  Southampton    no  False      0
1    woman       False    C    Cherbourg   yes  False      0
2    woman       False  NaN  Southampton   yes   True      0
3    woman       False    C  Southampton   yes  False      0
4      man        True  NaN  Southampton    no   True      0
..     ...         ...  ...          ...   ...    ...    ...
886    man        True  NaN  Southampton    no   True      0
887  woman       False    B  Southampton   yes   True      0
888  woman       False  NaN  Southampton    no  False      0
889    man        True    C    Cherbourg   yes   True      0
890    man        True  NaN   Queenstown    no   True      0

[891 rows x 16 columns]

In [7]:
titanic['age_0']=titanic['age']*10
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_0
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,220.0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,380.0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,260.0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,350.0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,350.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,270.0
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,190.0
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,NaN
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,260.0
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,320.0

In [8]:
titanic= titanic.drop('age_0', axis=1)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [9]:
#pclass기준 내림차순정렬
titanic.sort_values(by=['pclass'], ascending=False)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
511,0,3,male,NaN,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
500,0,3,male,17.0,0,0,8.6625,S,Third,man,True,NaN,Southampton,no,True
501,0,3,female,21.0,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,no,True
502,0,3,female,NaN,0,0,7.6292,Q,Third,woman,False,NaN,Queenstown,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
102,0,1,male,21.0,0,1,77.2875,S,First,man,True,D,Southampton,no,False
710,1,1,female,24.0,0,0,49.5042,C,First,woman,False,C,Cherbourg,yes,True
711,0,1,male,NaN,0,0,26.5500,S,First,man,True,C,Southampton,no,True
712,1,1,male,48.0,1,0,52.0000,S,First,man,True,C,Southampton,yes,False
445,1,1,male,4.0,0,2,81.8583,S,First,child,False,A,Southampton,yes,False

In [10]:
#pclass그룹의 age 최소값 최대값 합계
titanic.groupby(by='pclass')['age'].agg([min,max,sum])

         min   max      sum
pclass
1       0.92  80.0  7111.42
2       0.67  70.0  5168.83
3       0.42  74.0  8924.92

In [11]:
#pclass그룹의 age평균, survived합계
agg_format={'age':'mean', 'survived':'sum'}
titanic.groupby(by='pclass').agg(agg_format)

              age  survived
pclass
1       38.233441       136
2       29.877630        87
3       25.140620       119

In [12]:
#sex그룹의 age평균, survived합계
titanic.groupby(by='sex').agg(agg_format)

              age  survived
sex
female  27.915709       233
male    30.726645       109

In [13]:
np.random.seed()
df1 = pd.DataFrame(np.random.randint(10, size=(4,8)))
df1

   0  1  2  3  4  5  6  7
0  4  7  1  8  1  8  8  4
1  9  1  5  2  4  9  5  4
2  1  0  7  3  4  1  1  3
3  9  5  3  3  9  4  1  7

In [14]:
mpg = sns.load_dataset('mpg')
mpg.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10

In [15]:
mpg.describe()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
count,398.000000,398.000000,398.000000,392.000000,398.000000,398.000000,398.000000
mean,23.514573,5.454774,193.425879,104.469388,2970.424623,15.568090,76.010050
std,7.815984,1.701004,104.269838,38.491160,846.841774,2.757689,3.697627
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000
25%,17.500000,4.000000,104.250000,75.000000,2223.750000,13.825000,73.000000
50%,23.000000,4.000000,148.500000,93.500000,2803.500000,15.500000,76.000000
75%,29.000000,8.000000,262.000000,126.000000,3608.000000,17.175000,79.000000
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000

In [16]:
mpg["hp_per_cc"] = mpg.horsepower / mpg.displacement
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,hp_per_cc
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu,0.423453
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320,0.471429
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite,0.471698
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst,0.493421
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino,0.463576

In [20]:
def get_mfger(full_name):
    return full_name.split()[0]

In [23]:
def get_model(full_name):
    return ' '.join(full_name.split()[1:])

In [24]:
get_mfger('chevrolet chevelle malibu'),get_model('chevrolet chevelle malibu')

('chevrolet', 'chevelle malibu')

In [25]:
get_mfger('plymouth satellite'),get_model('plymouth satellite')

('plymouth', 'satellite')

In [27]:
mpg

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,hp_per_cc
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu,0.423453
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320,0.471429
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite,0.471698
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst,0.493421
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino,0.463576
...,...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl,0.614286
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup,0.536082
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage,0.622222
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger,0.658333
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10,0.689076

In [29]:
mpg["manufacturer"] = mpg.name.apply(get_mfger)
mpg["model"] = mpg.name.apply(get_model)
mpg

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name,hp_per_cc,manufacturer,model
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu,0.423453,chevrolet,chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320,0.471429,buick,skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite,0.471698,plymouth,satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst,0.493421,amc,rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino,0.463576,ford,torino
...,...,...,...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl,0.614286,ford,mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup,0.536082,vw,pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage,0.622222,dodge,rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger,0.658333,ford,ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10,0.689076,chevy,s-10

In [30]:
del mpg['name']

In [31]:
mpg.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,hp_per_cc,manufacturer,model
0,18.0,8,307.0,130.0,3504,12.0,70,usa,0.423453,chevrolet,chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,0.471429,buick,skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,0.471698,plymouth,satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,0.493421,amc,rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,0.463576,ford,torino

In [32]:
mpg[['cylinders','mpg']].groupby('cylinders').mean()

                 mpg
cylinders
3          20.550000
4          29.286765
5          27.366667
6          19.985714
8          14.963107

In [35]:
mpg[['displacement','cylinders','weight']].groupby('cylinders').mean()

           displacement       weight
cylinders
3             72.500000  2398.500000
4            109.796569  2308.127451
5            145.000000  3103.333333
6            218.142857  3198.226190
8            345.009709  4114.718447

In [37]:
mpg.pivot_table('mpg','cylinders')

                 mpg
cylinders
3          20.550000
4          29.286765
5          27.366667
6          19.985714
8          14.963107

In [42]:
mpg.pivot_table(mpg, index=['origin','hp_per_cc'])

                  acceleration  cylinders  displacement  horsepower  \
origin hp_per_cc
europe 0.420765          20.10        5.0         183.0        77.0
       0.458904          21.80        4.0         146.0        67.0
       0.474227          20.75        4.0          97.0        46.0
       0.503546          24.80        4.0         141.0        71.0
       0.524138          19.60        6.0         145.0        76.0
...                        ...        ...           ...         ...
usa    0.806122          17.70        4.0          98.0        79.0
       0.816327          14.70        4.0          98.0        80.0
       0.820513          17.00        4.0          97.5        80.0
       0.833333          14.50        4.0          90.0        75.0
       0.846939          15.90        4.0          98.0        83.0

                  model_year    mpg  weight
origin hp_per_cc
europe 0.420765         79.0  25.40  3530.0
       0.458904         80.0  30.00  3250.0
       0.474227         71.5  26.00  1892.5
       0.503546         79.0  27.20  3190.0
       0.524138         81.0  30.70  3160.0
...                      ...    ...     ...
usa    0.806122         76.0  26.00  2255.0
       0.816327         75.5  31.85  2039.5
       0.820513         72.0  25.00  2126.0
       0.833333         74.0  28.00  2125.0
       0.846939         77.0  33.50  2075.0

[232 rows x 7 columns]

In [43]:
mpg.pivot_table(mpg, index=['origin','hp_per_cc'], values=['cylinders','model_year'])
#왜 에러..

TypeError: pivot_table() got multiple values for argument 'values'